leander98/esp32-flight-controller/main/main.c
/**
 * @file main.c
 * @brief ESP32-S3 flight-controller application wiring IMU, control, ESCs,
 *        persistent settings, and the Wi-Fi remote together.
 */
#include <stdbool.h>
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <stdint.h>

#include <driver/gpio.h>
#include <driver/i2c_master.h>
#include <esp_err.h>
#include <esp_log.h>
#include <esp_timer.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <nvs.h>
#include <nvs_flash.h>

#include "esp32-ism330dlc.h"
#include "esp32-esc-xw30a.h"
#include "esp32-wifi-drone-remote.h"
#include "flight-controller.h"

#define IMU_I2C_PORT       I2C_NUM_0
#define IMU_I2C_SDA_GPIO   GPIO_NUM_9
#define IMU_I2C_SCL_GPIO   GPIO_NUM_8
#define IMU_I2C_FREQUENCY  400000U
#define IMU_I2C_ADDRESS    0x6AU
#define IMU_LOG_INTERVAL   256U
#define IMU_YIELD_INTERVAL 256U
#define IMU_NVS_NAMESPACE  "flight_imu"
#define IMU_NVS_CONFIG_KEY "config"
#define IMU_CONFIG_VERSION 1U
#define ESC_COUNT           ESP32_WIFI_DRONE_REMOTE_ESC_COUNT
#define ESC_NVS_NAMESPACE  "flight_esc"
#define ESC_NVS_CONFIG_KEY "channels"
#define ESC_CONFIG_VERSION 1U
#define PID_NVS_NAMESPACE  "flight_pid"
#define PID_NVS_CONFIG_KEY "gains"
#define PID_CONFIG_VERSION 3U
#define CONTROL_CORE        1
#define CONTROL_TASK_STACK  6144U
#define CONTROL_TASK_PRIORITY 10U

/** Logging tag used by the flight-controller application. */
static const char *APP_TAG = "flight-controller";
/** Spinlock protecting the telemetry snapshot shared with the HTTP task. */
static portMUX_TYPE s_telemetry_lock = portMUX_INITIALIZER_UNLOCKED;
/** Most recent body-frame IMU and filtered-attitude telemetry. */
static esp32_wifi_drone_remote_telemetry_t s_telemetry;
/** Serializes access to the shared IMU driver instance. */
static SemaphoreHandle_t s_imu_mutex;
/** Active ISM330DLC driver instance. */
static esp32_ism330dlc_t s_imu;
/** Serializes ESC reconfiguration and real-time PWM updates. */
static SemaphoreHandle_t s_esc_mutex;
/** Serializes flight-controller commands, settings, and updates. */
static SemaphoreHandle_t s_flight_mutex;
/** Runtime handles for the four ESC PWM channels. */
static xw30a_handle_t s_esc_handles[ESC_COUNT];
/** Active hardware configuration for each ESC PWM channel. */
static xw30a_config_t s_esc_configs[ESC_COUNT];
/** ESC selected by the guided programming sequence, or -1 when idle. */
static int s_programming_esc_index = -1;
/** Shared attitude estimator and stabilization controller state. */
static flight_controller_t s_flight_controller;
/** Latest normalized command received from both browser sticks. */
static flight_movement_command_t s_movement_command;

/** GPIO assignments used when no persisted ESC configuration exists. */
static const gpio_num_t s_default_esc_gpios[ESC_COUNT] = {
    GPIO_NUM_5, GPIO_NUM_7, GPIO_NUM_6, GPIO_NUM_4,
};

/** @brief Versioned representation of the ISM330 settings stored in NVS. */
typedef struct {
    uint8_t version;
    uint8_t accelerometer_odr;
    uint8_t gyroscope_odr;
    uint8_t accelerometer_full_scale;
    uint8_t gyroscope_full_scale;
} imu_persistent_config_t;

/** @brief Versioned persistent settings for all four ESC channels. */
typedef struct {
    uint8_t version;
    struct {
        uint8_t signal_gpio;
        uint16_t pwm_frequency_hz;
        uint16_t min_pulse_us;
        uint16_t max_pulse_us;
        uint16_t calibration_high_time_ms;
    } channel[ESC_COUNT];
} esc_persistent_config_t;

/** @brief Versioned flight-controller gains stored in NVS. */
typedef struct {
    uint8_t version;
    esp32_wifi_drone_remote_pid_config_t gains;
} pid_persistent_config_t;

/** @brief Return whether all submitted PID gains are finite and bounded. */
static bool is_valid_pid_config(
    const esp32_wifi_drone_remote_pid_config_t *config)
{
    if (config == NULL) {
        return false;
    }
    const float values[] = {
        config->roll_kp, config->roll_ki, config->roll_kd,
        config->pitch_kp, config->pitch_ki, config->pitch_kd,
        config->yaw_kp, config->yaw_ki, config->yaw_kd,
        config->altitude_kp, config->altitude_ki, config->altitude_kd,
    };
    for (size_t index = 0; index < sizeof(values) / sizeof(values[0]);
         ++index) {
        if (!isfinite(values[index]) ||
            values[index] < 0.0f || values[index] > 10.0f) {
            return false;
        }
    }
    return isfinite(config->armed_idle_throttle) &&
           config->armed_idle_throttle >= 0.01f &&
           config->armed_idle_throttle <= 0.30f;
}

/** @brief Return whether one ESC configuration is safe and supported. */
static bool is_valid_esc_config(const xw30a_config_t *config)
{
    if (config == NULL ||
        !GPIO_IS_VALID_OUTPUT_GPIO(config->signal_gpio) ||
        config->signal_gpio == IMU_I2C_SDA_GPIO ||
        config->signal_gpio == IMU_I2C_SCL_GPIO ||
        config->pwm_frequency_hz == 0U ||
        config->min_pulse_us == 0U ||
        config->min_pulse_us >= config->max_pulse_us ||
        config->calibration_high_time_ms == 0U) {
        return false;
    }
    return (1000000U / config->pwm_frequency_hz) >
           config->max_pulse_us;
}

/** @brief Fill all ESC channels with safe receiver-style PWM defaults. */
static void set_default_esc_configs(void)
{
    for (size_t index = 0; index < ESC_COUNT; ++index) {
        s_esc_configs[index] = (xw30a_config_t)
            XW30A_DEFAULT_CONFIG(s_default_esc_gpios[index]);
        s_esc_configs[index].mcpwm_group_id = index < 2U ? 0 : 1;
    }
}

/** @brief Store all ESC channel configurations as one atomic NVS blob. */
static esp_err_t save_esc_configs(void)
{
    esc_persistent_config_t stored = {
        .version = ESC_CONFIG_VERSION,
    };
    for (size_t index = 0; index < ESC_COUNT; ++index) {
        stored.channel[index].signal_gpio =
            s_esc_configs[index].signal_gpio;
        stored.channel[index].pwm_frequency_hz =
            s_esc_configs[index].pwm_frequency_hz;
        stored.channel[index].min_pulse_us =
            s_esc_configs[index].min_pulse_us;
        stored.channel[index].max_pulse_us =
            s_esc_configs[index].max_pulse_us;
        stored.channel[index].calibration_high_time_ms =
            s_esc_configs[index].calibration_high_time_ms;
    }

