leander98/esp32-flight-controller/main/main.c
/** @brief Save the active ISM330 configuration to non-volatile storage. */
static esp_err_t save_imu_config(const esp32_ism330dlc_t *imu)
{
    if (imu == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    const imu_persistent_config_t stored = {
        .version = IMU_CONFIG_VERSION,
        .accelerometer_odr = imu->accel_odr,
        .gyroscope_odr = imu->gyro_odr,
        .accelerometer_full_scale = imu->accel_full_scale,
        .gyroscope_full_scale = imu->gyro_full_scale,
    };
    nvs_handle_t nvs;
    esp_err_t err = nvs_open(IMU_NVS_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) {
        return err;
    }
    err = nvs_set_blob(nvs, IMU_NVS_CONFIG_KEY, &stored, sizeof(stored));
    if (err == ESP_OK) {
        err = nvs_commit(nvs);
    }
    nvs_close(nvs);
    return err;
}

/**
 * @brief Load persisted settings into an ISM330 instance.
 *
 * Missing, obsolete, or invalid data leaves the driver's defaults unchanged.
 */
static esp_err_t load_imu_config(esp32_ism330dlc_t *imu)
{
    if (imu == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    nvs_handle_t nvs;
    esp_err_t err = nvs_open(IMU_NVS_NAMESPACE, NVS_READONLY, &nvs);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return ESP_OK;
    }
    if (err != ESP_OK) {
        return err;
    }

    imu_persistent_config_t stored = {0};
    size_t stored_size = sizeof(stored);
    err = nvs_get_blob(nvs, IMU_NVS_CONFIG_KEY, &stored, &stored_size);
    nvs_close(nvs);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return ESP_OK;
    }
    if (err != ESP_OK) {
        return err;
    }
    if (stored_size != sizeof(stored) ||
        !is_valid_persistent_imu_config(&stored)) {
        ESP_LOGW(APP_TAG, "Ignoring invalid persisted ISM330 configuration");
        return ESP_OK;
    }

    imu->accel_odr = stored.accelerometer_odr;
    imu->gyro_odr = stored.gyroscope_odr;
    imu->accel_full_scale = stored.accelerometer_full_scale;
    imu->gyro_full_scale = stored.gyroscope_full_scale;
    ESP_LOGI(APP_TAG, "Restored persisted ISM330 configuration");
    return ESP_OK;
}

/**
 * @brief Copy the latest IMU sample into a webserver telemetry response.
 */
static esp_err_t provide_remote_telemetry(
    esp32_wifi_drone_remote_telemetry_t *telemetry,
    void *context)
{
    (void)context;
    if (telemetry == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    portENTER_CRITICAL(&s_telemetry_lock);
    *telemetry = s_telemetry;
    portEXIT_CRITICAL(&s_telemetry_lock);
    return ESP_OK;
}

/** @brief Return the active ISM330DLC acquisition settings. */
static esp_err_t get_remote_imu_config(
    esp32_wifi_drone_remote_imu_config_t *config,
    void *context)
{
    esp32_ism330dlc_t *imu = context;
    if (config == NULL || imu == NULL || s_imu_mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (xSemaphoreTake(s_imu_mutex, pdMS_TO_TICKS(250)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    *config = (esp32_wifi_drone_remote_imu_config_t) {
        .accelerometer_odr = imu->accel_odr,
        .gyroscope_odr = imu->gyro_odr,
        .accelerometer_full_scale = imu->accel_full_scale,
        .gyroscope_full_scale = imu->gyro_full_scale,
    };
    xSemaphoreGive(s_imu_mutex);
    return ESP_OK;
}

/** @brief Apply web-submitted acquisition settings to the ISM330DLC. */
static esp_err_t set_remote_imu_config(
    const esp32_wifi_drone_remote_imu_config_t *config,
    void *context)
{
    esp32_ism330dlc_t *imu = context;
    if (config == NULL || imu == NULL || s_imu_mutex == NULL ||
        config->accelerometer_odr > ISM330DLC_ODR_6660_HZ ||
        config->gyroscope_odr > ISM330DLC_ODR_6660_HZ ||
        config->accelerometer_full_scale > ISM330DLC_ACCEL_FS_8G ||
        config->gyroscope_full_scale > ISM330DLC_GYRO_FS_2000_DPS) {
        return ESP_ERR_INVALID_ARG;
    }
    if (xSemaphoreTake(s_imu_mutex, pdMS_TO_TICKS(500)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    esp32_ism330dlc_odr_t old_accel_odr = imu->accel_odr;
    esp32_ism330dlc_odr_t old_gyro_odr = imu->gyro_odr;
    esp32_ism330dlc_accel_fs_t old_accel_scale = imu->accel_full_scale;
    esp32_ism330dlc_gyro_fs_t old_gyro_scale = imu->gyro_full_scale;
    imu->accel_odr = config->accelerometer_odr;
    imu->gyro_odr = config->gyroscope_odr;
    imu->accel_full_scale = config->accelerometer_full_scale;
    imu->gyro_full_scale = config->gyroscope_full_scale;

    esp_err_t err = esp32_ism330dlc_init(imu);
    if (err == ESP_OK) {
        err = save_imu_config(imu);
    }
    if (err != ESP_OK) {
        imu->accel_odr = old_accel_odr;
        imu->gyro_odr = old_gyro_odr;
        imu->accel_full_scale = old_accel_scale;
        imu->gyro_full_scale = old_gyro_scale;
        esp32_ism330dlc_init(imu);
    }
    xSemaphoreGive(s_imu_mutex);
    return err;
}

/** @brief Copy web-facing gains into the internal controller configuration. */
static void apply_pid_config(
    flight_controller_config_t *destination,
    const esp32_wifi_drone_remote_pid_config_t *source)
{
    destination->roll.kp = source->roll_kp;
    destination->roll.ki = source->roll_ki;
    destination->roll.kd = source->roll_kd;
    destination->pitch.kp = source->pitch_kp;
    destination->pitch.ki = source->pitch_ki;
    destination->pitch.kd = source->pitch_kd;
    destination->yaw_rate.kp = source->yaw_kp;
    destination->yaw_rate.ki = source->yaw_ki;
    destination->yaw_rate.kd = source->yaw_kd;
    destination->vertical_velocity.kp = source->altitude_kp;
    destination->vertical_velocity.ki = source->altitude_ki;
    destination->vertical_velocity.kd = source->altitude_kd;
    destination->armed_idle_throttle = source->armed_idle_throttle;
    destination->stabilize_at_minimum_throttle =
        source->stabilize_at_minimum_throttle;
}

/** @brief Convert internal controller gains to their web-facing structure. */
static esp32_wifi_drone_remote_pid_config_t export_pid_config(
    const flight_controller_config_t *source)
{
    return (esp32_wifi_drone_remote_pid_config_t) {
        .roll_kp = source->roll.kp,
        .roll_ki = source->roll.ki,
        .roll_kd = source->roll.kd,
        .pitch_kp = source->pitch.kp,
        .pitch_ki = source->pitch.ki,
        .pitch_kd = source->pitch.kd,
        .yaw_kp = source->yaw_rate.kp,
        .yaw_ki = source->yaw_rate.ki,
        .yaw_kd = source->yaw_rate.kd,
        .altitude_kp = source->vertical_velocity.kp,
        .altitude_ki = source->vertical_velocity.ki,
        .altitude_kd = source->vertical_velocity.kd,
        .armed_idle_throttle = source->armed_idle_throttle,
        .stabilize_at_minimum_throttle =
            source->stabilize_at_minimum_throttle,
    };
}

